test/site/content-org/all-posts.org
#+hugo_base_dir: ../

#+seq_todo: TODO DRAFT DONE
#+seq_todo: TEST__TODO | TEST__DONE

#+property: header-args :eval no

#+startup: indent

#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]

# https://scripter.co/latex-in-html/
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@

#+author:

** Indented source block :indented:lists:code_fence:highlight:code_block:@upstream:
:PROPERTIES:
:EXPORT_FILE_NAME: source-block-indented
:END:
#+begin_description
Test that indented source blocks, and also the ones in lists export
fine.
#+end_description

Some content.

    #+begin_src emacs-lisp
    (defun small-shell ()
	(interactive)
	(split-window-vertically)
	(other-window 1)
	(shrink-window (- (window-height) 12))
    (ansi-term))
    #+end_src
*** Code blocks in list using code fences
Reference: {{{hugoissue(4006)}}}

- List item 1
  #+begin_src emacs-lisp
  (message "I am in list at level-1 indentation")
  #+end_src
  - List item 1.1
    #+begin_src emacs-lisp
    (message "I am in list at level-2 indentation")
    #+end_src
    - List item 1.1.1
      #+begin_src emacs-lisp
      (message "I am in list at level-3 indentation")
      #+end_src
  - List item 2.1
    #+begin_src emacs-lisp
    (message "I am in list back at level-2 indentation")
    #+end_src
- List item 2
  #+begin_src emacs-lisp
  (message "I am in list back at level-1 indentation")
  #+end_src

#+begin_src emacs-lisp
(message "And now I am at level-0 indentation")
#+end_src
*** Code blocks in list using ~highlight~ shortcode
Reference: {{{hugoissue(4717)}}}, {{{oxhugoissue(161)}}}

This is an *upstream* bug in ~hugo~ as of 2018-05-12. The issues is
that when the code blocks in ~highlight~ shortcodes are inserted at
the required indentation levels in lists.. so that they get rendered
*in* the list at *that* indentation level, those indentations are not
removed by ~hugo~, and thus become part of those code blocks.

Also, related to this issue, it can be seen that all such indented
code blocks have an empty second line too, probably just due to the
unremoved indentation on the last line of those code blocks.

In the above section, the same code blocks are code-fenced instead of
using ~highlight~ shortcode, and the extra indentation is not seen
there.

- List item 1
  #+begin_src emacs-lisp -n
  (message "I am in list at level-1 indentation")
  #+end_src
  - List item 1.1
    #+begin_src emacs-lisp -n
    (message "I am in list at level-2 indentation")
    #+end_src
    - List item 1.1.1
      #+begin_src emacs-lisp -n
      (message "I am in list at level-3 indentation")
      #+end_src
  - List item 2.1
    #+begin_src emacs-lisp -n
    (message "I am in list back at level-2 indentation")
    #+end_src
- List item 2
  #+begin_src emacs-lisp -n
  (message "I am in list back at level-1 indentation")
  #+end_src

#+begin_src emacs-lisp -n
(message "And now I am at level-0 indentation")
#+end_src
